export type Message = {
  id: string;
  text: string;
  isMine: boolean;
};

export const SAMPLE_MESSAGES: Message[] = [
  { id: "1", text: "가나다라마", isMine: false },
  { id: "2", text: "가나다라마", isMine: true },
  {
    id: "3",
    text: "김하성은 11일 시애틀 매리너스와김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다. 시애틀의 우완 에이스 브라이언 우의 싱커를 공략해 좌익수 방면 1타점 2루타를 터트렸다.이어 4회 2사 주자 없는 상황에서 맞은 두번째 타석. 우의 155km 초구를 정확히 공략해 좌측 담장을 그대로 넘어가는 시즌 2호 솔로 홈런을 터트렸다. 타구속도가 165km에 달하는 강한 타구였다. 김하성은 부상 복귀 이후 네 번째 경기였던 지난달 11일 보스턴 레드삭스전에서 템파베이 이적 후 첫 홈런을 기록한 뒤 정확히 한 달만에 2호 홈런을 터트렸다.",
    isMine: true,
  },
  { id: "4", text: "가나다라마", isMine: false },
  { id: "5", text: "가나다라가나다라마", isMine: true },
  { id: "7", text: "가나다라마", isMine: false },
  { id: "8", text: "가나다라마", isMine: false },
  {
    id: "9",
    text: "김하성은 11일 시애틀 매리너스와김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다. 시애틀의 우완 에이스 브라이언 우의 싱커를 공략해 좌익수 방면 1타점 2루타를 터트렸다.이어 4회 2사 주자 없는 상황에서 맞은 두번째 타석. 우의 155km 초구를 정확히 공략해 좌측 담장을 그대로 넘어가는 시즌 2호 솔로 홈런을 터트렸다. 타구속도가 165km에 달하는 강한 타구였다. 김하성은 부상 복귀 이후 네 번째 경기였던 지난달 11일 보스턴 레드삭스전에서 템파베이 이적 후 첫 홈런을 기록한 뒤 정확히 한 달만에 2호 홈런을 터트렸다.",
    isMine: false,
  },
  { id: "10", text: "가나다라마", isMine: true },
  { id: "11", text: "가나다라마", isMine: true },
  { id: "12", text: "가나다라마", isMine: false },
  { id: "13", text: "가나다라마", isMine: true },
  { id: "14", text: "가나다라마", isMine: false },
  { id: "16", text: "가나다라마", isMine: true },
];

export const SAMPLE_CHATS = [
  { id: "1", name: "에렌 예거", lastMessage: "벽 밖이 어떤지 직접 보고 싶어." },
  {
    id: "2",
    name: "미카사 아커만",
    lastMessage: "조심해. 항상 등 뒤도 신경 써.",
  },
  {
    id: "3",
    name: "아르민 알레르트",
    lastMessage: "새로운 작전 아이디어가 있어.",
  },
  {
    id: "4",
    name: "리바이 아커만",
    lastMessage: "정리하고 와. 시간 낭비는 싫다.",
  },
  { id: "5", name: "한지 조에", lastMessage: "거인 샘플 데이터 정리했어!" },
  {
    id: "6",
    name: "사샤 브라우스",
    lastMessage: "감자… 아니, 간식 좀 가져갈게.",
  },
  {
    id: "7",
    name: "코니 스프링어",
    lastMessage: "오늘 훈련 끝나고 잠깐 볼래?",
  },
  {
    id: "8",
    name: "장 키르슈타인",
    lastMessage: "현실적으로 판단하자고, 에렌.",
  },
  { id: "9", name: "히스토리아 레이스", lastMessage: "괜찮아. 내가 책임질게." },
  {
    id: "10",
    name: "애니 레온하트",
    lastMessage: "시간 낭비하지 말고 바로 해.",
  },
];

export const TopicListTypeItem = [
  {
    id: 11,
    title: "자유란 무엇인가",
    content: "네게 자유란 어떤 의미인가? 그것을 얻기 위해 무엇까지 할 수 있나?",
    category: "철학",
    createdAt: "2025-08-15T11:50:54.319Z",
    updatedAt: "2025-08-15T11:50:54.319Z",
  },
  {
    id: 10,
    title: "벽이 무너진 날",
    content: "벽이 무너지고 처음 혼란에 휩싸였던 그날, 네가 본 광경을 들려줘.",
    category: "사건",
    createdAt: "2025-08-15T11:50:50.079Z",
    updatedAt: "2025-08-15T11:50:50.079Z",
  },
  {
    id: 9,
    title: "거인화 능력에 대한 생각",
    content: "거인화 능력을 가졌다면, 네가 그 힘을 어떻게 쓰고 싶나?",
    category: "능력",
    createdAt: "2025-08-15T11:50:45.862Z",
    updatedAt: "2025-08-15T11:50:45.862Z",
  },
  {
    id: 8,
    title: "가장 믿는 동료",
    content: "생사를 함께 걸 수 있는 동료는 누구인가? 그 이유는?",
    category: "인물",
    createdAt: "2025-08-15T11:50:40.833Z",
    updatedAt: "2025-08-15T11:50:40.833Z",
  },
  {
    id: 7,
    title: "벽 안에서의 일상",
    content: "전투가 없는 날, 네가 즐기는 일상이나 작은 행복은 무엇인가?",
    category: "일상",
    createdAt: "2025-08-15T11:50:02.423Z",
    updatedAt: "2025-08-15T11:50:02.423Z",
  },
  {
    id: 6,
    title: "군단에 들어온 이유",
    content:
      "왜 조사병단/주둔병단/헌병단에 들어오게 되었나? 그 선택에 후회는 없나?",
    category: "동기",
    createdAt: "2025-08-15T11:49:52.895Z",
    updatedAt: "2025-08-15T11:49:52.895Z",
  },
  {
    id: 5,
    title: "가장 두려웠던 순간",
    content: "거인과 맞서 싸우며 가장 공포를 느낀 순간은 언제였나?",
    category: "감정",
    createdAt: "2025-08-15T11:49:45.974Z",
    updatedAt: "2025-08-15T11:49:45.974Z",
  },
  {
    id: 4,
    title: "동료를 잃은 날",
    content:
      "전장에서 동료를 잃었을 때, 그날의 심정과 이후의 변화를 이야기해줘.",
    category: "회상",
    createdAt: "2025-08-15T11:49:38.890Z",
    updatedAt: "2025-08-15T11:49:38.890Z",
  },
  {
    id: 3,
    title: "첫 전투의 기억",
    content:
      "처음 거인을 마주했을 때의 감정과 그 순간을 어떻게 이겨냈는지 말해줄래?",
    category: "전투",
    createdAt: "2025-08-15T11:49:30.545Z",
    updatedAt: "2025-08-15T11:49:30.545Z",
  },
  {
    id: 2,
    title: "벽 너머의 세상",
    content:
      "네가 상상하는 벽 밖의 세상은 어떤 모습일까? 거기서 무엇을 보고 싶나?",
    category: "탐험",
    createdAt: "2025-08-15T11:49:22.081Z",
    updatedAt: "2025-08-15T11:49:22.081Z",
  },
  {
    id: 1,
    title: "가장 기억에 남는 여행",
    content:
      "당신에게 가장 기억에 남는 여행은 어디였나요? 그곳에서의 경험을 들려주세요.",
    category: "경험",
    createdAt: "2025-08-15T11:45:02.244Z",
    updatedAt: "2025-08-15T11:45:02.244Z",
  },
];
