export type Message = {
  id: string;
  text: string;
  isMine: boolean;
};

export const SAMPLE_MESSAGES: Message[] = [
  { id: "1", text: "가나다라마", isMine: false },
  { id: "2", text: "가나다라마", isMine: true },
  {
    id: "3",
    text: "김하성은 11일 시애틀 매리너스와김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다. 시애틀의 우완 에이스 브라이언 우의 싱커를 공략해 좌익수 방면 1타점 2루타를 터트렸다.이어 4회 2사 주자 없는 상황에서 맞은 두번째 타석. 우의 155km 초구를 정확히 공략해 좌측 담장을 그대로 넘어가는 시즌 2호 솔로 홈런을 터트렸다. 타구속도가 165km에 달하는 강한 타구였다. 김하성은 부상 복귀 이후 네 번째 경기였던 지난달 11일 보스턴 레드삭스전에서 템파베이 이적 후 첫 홈런을 기록한 뒤 정확히 한 달만에 2호 홈런을 터트렸다.",
    isMine: true,
  },
  { id: "4", text: "가나다라마", isMine: false },
  { id: "5", text: "가나다라가나다라마", isMine: true },
  { id: "7", text: "가나다라마", isMine: false },
  { id: "8", text: "가나다라마", isMine: false },
  {
    id: "9",
    text: "김하성은 11일 시애틀 매리너스와김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 김하성은 11일 시애틀 매리너스와의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 의 원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다.원정 경기에서 7번 타자 유격수로 선발 출전해 0-4로 팀이 지고 있던 2회 1사 2루에서 맞은 첫 타석에 섰다. 시애틀의 우완 에이스 브라이언 우의 싱커를 공략해 좌익수 방면 1타점 2루타를 터트렸다.이어 4회 2사 주자 없는 상황에서 맞은 두번째 타석. 우의 155km 초구를 정확히 공략해 좌측 담장을 그대로 넘어가는 시즌 2호 솔로 홈런을 터트렸다. 타구속도가 165km에 달하는 강한 타구였다. 김하성은 부상 복귀 이후 네 번째 경기였던 지난달 11일 보스턴 레드삭스전에서 템파베이 이적 후 첫 홈런을 기록한 뒤 정확히 한 달만에 2호 홈런을 터트렸다.",
    isMine: false,
  },
  { id: "10", text: "가나다라마", isMine: true },
  { id: "11", text: "가나다라마", isMine: true },
  { id: "12", text: "가나다라마", isMine: false },
  { id: "13", text: "가나다라마", isMine: true },
  { id: "14", text: "가나다라마", isMine: false },
  { id: "16", text: "가나다라마", isMine: true },
];

export const SAMPLE_CHATS = [
  { id: "1", name: "에렌 예거", lastMessage: "벽 밖이 어떤지 직접 보고 싶어." },
  {
    id: "2",
    name: "미카사 아커만",
    lastMessage: "조심해. 항상 등 뒤도 신경 써.",
  },
  {
    id: "3",
    name: "아르민 알레르트",
    lastMessage: "새로운 작전 아이디어가 있어.",
  },
  {
    id: "4",
    name: "리바이 아커만",
    lastMessage: "정리하고 와. 시간 낭비는 싫다.",
  },
  { id: "5", name: "한지 조에", lastMessage: "거인 샘플 데이터 정리했어!" },
  {
    id: "6",
    name: "사샤 브라우스",
    lastMessage: "감자… 아니, 간식 좀 가져갈게.",
  },
  {
    id: "7",
    name: "코니 스프링어",
    lastMessage: "오늘 훈련 끝나고 잠깐 볼래?",
  },
  {
    id: "8",
    name: "장 키르슈타인",
    lastMessage: "현실적으로 판단하자고, 에렌.",
  },
  { id: "9", name: "히스토리아 레이스", lastMessage: "괜찮아. 내가 책임질게." },
  {
    id: "10",
    name: "애니 레온하트",
    lastMessage: "시간 낭비하지 말고 바로 해.",
  },
];
